'''
RDB— для файла резервной копии базы данных Redis .
Файл RDB — это дамп всех пользовательских данных, хранящихся во внутреннем сжатом формате сериализации в определенной временной метке, который используется для восстановления на определенный момент времени (восстановление из временной метки).

AOF - означает Append Only File (только добавление файла) .
AOF на самом деле является методом сохранения, при котором файл RDB генерируется один раз, а все данные добавляются к нему по мере поступления.
'''